{"weightsManifest": [{"weights": [{"name": "batch_normalization_1/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/moving_variance", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_2/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/moving_variance", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_3/gamma", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_3/beta", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_3/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_3/moving_variance", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_4/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_5/gamma", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_5/beta", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_5/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_5/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_6/gamma", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_6/beta", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_6/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_6/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_7/gamma", "dtype": "float32", "shape": [1024]}, {"name": "batch_normalization_7/beta", "dtype": "float32", "shape": [1024]}, {"name": "batch_normalization_7/moving_mean", "dtype": "float32", "shape": [1024]}, {"name": "batch_normalization_7/moving_variance", "dtype": "float32", "shape": [1024]}, {"name": "batch_normalization_8/gamma", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_8/beta", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_8/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_8/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 3, 16]}, {"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 16, 32]}, {"name": "conv2d_3/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_4/kernel", "dtype": "float32", "shape": [3, 3, 64, 128]}, {"name": "conv2d_5/kernel", "dtype": "float32", "shape": [3, 3, 128, 256]}, {"name": "conv2d_6/kernel", "dtype": "float32", "shape": [3, 3, 256, 512]}, {"name": "conv2d_7/kernel", "dtype": "float32", "shape": [3, 3, 512, 1024]}, {"name": "conv2d_8/kernel", "dtype": "float32", "shape": [3, 3, 1024, 512]}, {"name": "conv2d_9/kernel", "dtype": "float32", "shape": [1, 1, 512, 35]}, {"name": "conv2d_9/bias", "dtype": "float32", "shape": [35]}], "paths": ["group1-shard1of11", "group1-shard2of11", "group1-shard3of11", "group1-shard4of11", "group1-shard5of11", "group1-shard6of11", "group1-shard7of11", "group1-shard8of11", "group1-shard9of11", "group1-shard10of11", "group1-shard11of11"]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 416, 416, 3]}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": false, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [3, 3], "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_1", "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "batch_normalization_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "same", "name": "max_pooling2d_1"}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"use_bias": false, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [3, 3], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_2", "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "batch_normalization_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "same", "name": "max_pooling2d_2"}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"use_bias": false, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [3, 3], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_3", "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "batch_normalization_3"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "same", "name": "max_pooling2d_3"}, "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"use_bias": false, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [3, 3], "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_4", "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "batch_normalization_4"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "same", "name": "max_pooling2d_4"}, "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"use_bias": false, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [3, 3], "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_5", "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "batch_normalization_5"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "same", "name": "max_pooling2d_5"}, "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"use_bias": false, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [3, 3], "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_6", "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "batch_normalization_6"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_6"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [1, 1], "trainable": true, "pool_size": [2, 2], "padding": "same", "name": "max_pooling2d_6"}, "name": "max_pooling2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"use_bias": false, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [3, 3], "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1024, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_7", "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "batch_normalization_7"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"use_bias": false, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [3, 3], "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_8", "momentum": 0.99, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "batch_normalization_8"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"use_bias": true, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "kernel_size": [1, 1], "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 35, "padding": "same", "bias_regularizer": null, "bias_constraint": null}, "name": "conv2d_9"}], "output_layers": [["conv2d_9", 0, 0]], "name": "model_1"}}, "keras_version": "2.2.4"}}